
############################################################
#	Simple search used in Home page to show
#	numbers of hosts indexed within last 7 days
############################################################

[Hosts with data within last 7 days]
action.email.reportServerEnabled = 0
alert.track = 0
auto_summarize = 0
auto_summarize.dispatch.earliest_time = -7d@d
cron_schedule = 0 * * * *
description = Number of hosts with data within last 7 days
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
display.general.type = statistics
display.visualizations.chartHeight = 420
display.visualizations.charting.chart = area
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = nmon
request.ui_dispatch_view = search
search = | pivot NMON_Config Nmon_Config last(AIX_Machine_SerialNumber) AS "AIX_Machine_SerialNumber" dc(hostname) AS "dcount" SPLITROW hostname AS hostname SORT 0 hostname ROWSUMMARY 0 COLSUMMARY 0 NUMCOLS 0 SHOWOTHER 0\
| eval serialnum=if(isnull(AIX_Machine_SerialNumber), hostname, AIX_Machine_SerialNumber) | fields hostname,serialnum | stats count

#############################################################
# Indexing Volume
#############################################################

[Volume of Data indexed Today]
action.email.reportServerEnabled = 0
action.email.useNSSubject = 1
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize = 1
auto_summarize.dispatch.earliest_time = -1d@h
cron_schedule = */2 * * * *
dispatch.earliest_time = @d
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = fast
display.statistics.drilldown = none
display.statistics.rowNumbers = 1
display.visualizations.chartHeight = 420
display.visualizations.charting.chart.style = minimal
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = nmon
request.ui_dispatch_view = search
search = index=_internal source=*license_usage.log* type=Usage idx=nmon | stats sum(b) AS volume | eval trend1=round((volume/1024/1024),2) | fields trend1\
| appendcols\
[ search index=_internal source=*license_usage.log* type=Usage idx=nmon earliest="-1d@d" latest="@d" | stats sum(b) AS volume | eval trend2=round((volume/1024/1024),2) | fields trend2 ]\
| transpose | fields row* | rename "row 1" As value

#############################################################
# NMON Inventory
#############################################################

# This report will generate the inventory lookup table used in many interfaces of the App.
# We arbitrary only keep one result per day and per host of the nmon_config sourcetype, then we keep the last value by field in case of multiple values found, typically an hardware configuration
# change

[Generate NMON Inventory Lookup Table]
action.email.reportServerEnabled = 0
action.email.useNSSubject = 1
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize = 0
auto_summarize.dispatch.earliest_time =
cron_schedule = 0 * * * *
description = Generation of NMON Inventory Lookup Table
dispatch.earliest_time =
dispatch.latest_time = now
dispatch.ttl = 14400 # Keep 4 hours this job artefact
display.events.fields = ["host","source","sourcetype","hostname"]
display.events.type = raw
display.general.type = statistics
display.statistics.drilldown = none
display.statistics.rowNumbers = 1
display.visualizations.chartHeight = 420
display.visualizations.charting.chart = line
display.visualizations.charting.chart.style = minimal
display.visualizations.show = 0
display.visualizations.type = singlevalue
enableSched = 1
request.ui_dispatch_app = nmon
request.ui_dispatch_view = search
search = | tstats last("Nmon_Config.AIX_Machine_SerialNumber") AS AIX_Machine_SerialNumber\
last("Nmon_Config.AIX_virtualcpus") AS AIX_virtualcpus\
last("Nmon_Config.AIX_logicalcores") AS AIX_logicalcores\
last("Nmon_Config.AIX_entitled") AS AIX_entitled\
last("Nmon_Config.AIX_LEVEL") AS AIX_LEVEL\
last("Nmon_Config.AIX_processor_mode") AS AIX_processor_mode\
last("Nmon_Config.AIX_processor_clockspeed") AS AIX_processor_clockspeed\
last("Nmon_Config.AIX_cpu_type") AS AIX_cpu_type\
last("Nmon_Config.AIX_kernel_type") AS AIX_kernel_type\
last("Nmon_Config.AIX_plateform_firmware_level") AS AIX_plateform_firmware_level\
last("Nmon_Config.AIX_PoolID") AS AIX_PoolID\
last("Nmon_Config.AIX_system_installed_CPUs") AS AIX_system_installed_CPUs\
last("Nmon_Config.AIX_system_active_CPUs") AS AIX_system_active_CPUs\
last("Nmon_Config.AIX_PoolCPUs") AS AIX_PoolCPUs\
last("Nmon_Config.Linux_memory_MB") AS Linux_memory_MB\
last("Nmon_Config.Linux_swap_MB") AS Linux_swap_MB\
last("Nmon_Config.Linux_distribution") AS Linux_distribution\
last("Nmon_Config.Linux_vendor") AS Linux_vendor\
last("Nmon_Config.Linux_kernelversion") AS Linux_kernelversion\
last("Nmon_Config.Solaris_version") AS Solaris_version\
last("Nmon_Config.Solaris_sunOS_version") AS Solaris_sunOS_version\
last("Nmon_Config.Solaris_processor_clockspeed") AS Solaris_processor_clockspeed\
last("Nmon_Config.Processor") AS Processor\
last("Nmon_Config.cpu_cores") AS cpu_cores\
last("Nmon_Config.nmon_version") AS nmon_version\
from datamodel=NMON_Config where (nodename = Nmon_Config) groupby "Nmon_Config.hostname", "Nmon_Config.OStype" prestats=true\
| stats dedup_splitvals=t\
last("Nmon_Config.AIX_Machine_SerialNumber") AS AIX_Machine_SerialNumber\
last("Nmon_Config.AIX_virtualcpus") AS AIX_virtualcpus\
last("Nmon_Config.AIX_logicalcores") AS AIX_logicalcores\
last("Nmon_Config.AIX_entitled") AS AIX_entitled\
last("Nmon_Config.AIX_LEVEL") AS AIX_LEVEL\
last("Nmon_Config.AIX_processor_mode") AS AIX_processor_mode\
last("Nmon_Config.AIX_processor_clockspeed") AS AIX_processor_clockspeed\
last("Nmon_Config.AIX_cpu_type") AS AIX_cpu_type\
last("Nmon_Config.AIX_kernel_type") AS AIX_kernel_type\
last("Nmon_Config.AIX_plateform_firmware_level") AS AIX_plateform_firmware_level\
last("Nmon_Config.AIX_PoolID") AS AIX_PoolID\
last("Nmon_Config.AIX_system_installed_CPUs") AS AIX_system_installed_CPUs\
last("Nmon_Config.AIX_system_active_CPUs") AS AIX_system_active_CPUs\
last("Nmon_Config.AIX_PoolCPUs") AS AIX_PoolCPUs\
last("Nmon_Config.Linux_memory_MB") AS Linux_memory_MB\
last("Nmon_Config.Linux_swap_MB") AS Linux_swap_MB\
last("Nmon_Config.Linux_distribution") AS Linux_distribution\
last("Nmon_Config.Linux_vendor") AS Linux_vendor\
last("Nmon_Config.Linux_kernelversion") AS Linux_kernelversion\
last("Nmon_Config.Solaris_version") AS Solaris_version\
last("Nmon_Config.Solaris_sunOS_version") AS Solaris_sunOS_version\
last("Nmon_Config.Solaris_processor_clockspeed") AS Solaris_processor_clockspeed\
last("Nmon_Config.Processor") AS Processor\
last("Nmon_Config.cpu_cores") AS cpu_cores\
last("Nmon_Config.nmon_version") AS nmon_version by "Nmon_Config.hostname", "Nmon_Config.OStype"\
| sort limit=0 "Nmon_Config.hostname"\
| fields - _span\
| rename "Nmon_Config.hostname" AS hostname "Nmon_Config.OStype" AS OStype\
| fields hostname, OStype, AIX_Machine_SerialNumber, AIX_virtualcpus, AIX_logicalcores, AIX_entitled, AIX_LEVEL,\
AIX_processor_mode, AIX_processor_clockspeed, AIX_cpu_type, AIX_kernel_type, AIX_plateform_firmware_level, AIX_PoolID,\
AIX_system_installed_CPUs, AIX_system_active_CPUs, AIX_PoolCPUs, Linux_memory_MB, Linux_swap_MB, Linux_distribution,\
Linux_vendor, Linux_kernelversion, Solaris_version, Solaris_sunOS_version, Solaris_processor_clockspeed, Processor, cpu_cores, nmon_version\
| fillnull value=Undeterminated\
| outputlookup nmon_inventory

####################################################################
# NMON Processing Errors: Number of errors reported in last 24 hours
####################################################################

[Number of Errors in Data Processing or Data Collect since last 24 Hours]
action.email.reportServerEnabled = 0
action.email.useNSSubject = 1
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize = 1
auto_summarize.dispatch.earliest_time = -1d@h
cron_schedule = */2 * * * *
dispatch.earliest_time = -24h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = fast
display.statistics.drilldown = none
display.statistics.rowNumbers = 1
display.visualizations.chartHeight = 420
display.visualizations.charting.chart.style = minimal
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = nmon
request.ui_dispatch_view = search
search = index=nmon sourcetype=nmon_processing OR sourcetype=nmon_collect error | stats count As trend1\
| appendcols\
[ search index=nmon sourcetype=nmon_processing OR sourcetype=nmon_collect error earliest="-1d@d" latest="@d" | stats count As trend2 ]\
| transpose | fields row* | rename "row 1" As value

#############################################################
# NMON Processing Errors
#############################################################

[Errors in NMON Data Processing]
action.email.reportServerEnabled = 0
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = -24h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","hostname"]
display.events.type = raw
display.statistics.drilldown = none
display.statistics.rowNumbers = 1
display.visualizations.chartHeight = 420
display.visualizations.charting.chart = line
display.visualizations.charting.chart.style = minimal
display.visualizations.show = 0
display.visualizations.type = singlevalue
request.ui_dispatch_app = nmon
request.ui_dispatch_view = search
search = index=nmon sourcetype=nmon_processing error


#############################################################
# NMON Collect Errors
#############################################################

[Errors in NMON Data Collect]
action.email.reportServerEnabled = 0
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = -24h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","hostname"]
display.events.type = raw
display.statistics.drilldown = none
display.statistics.rowNumbers = 1
display.visualizations.chartHeight = 420
display.visualizations.charting.chart = line
display.visualizations.charting.chart.style = minimal
display.visualizations.show = 0
display.visualizations.type = singlevalue
request.ui_dispatch_app = nmon
request.ui_dispatch_view = search
search = index=nmon sourcetype=nmon_collect error


#############################################################
# NMON Collect Activity
#############################################################

[Activity of NMON Data Collect]
action.email.reportServerEnabled = 0
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = -24h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","hostname"]
display.events.type = raw
display.general.type = statistics
display.statistics.drilldown = none
display.statistics.rowNumbers = 1
display.visualizations.chartHeight = 420
display.visualizations.charting.chart = line
display.visualizations.charting.chart.style = minimal
display.visualizations.show = 0
display.visualizations.type = singlevalue
request.ui_dispatch_app = nmon
request.ui_dispatch_view = search
search = index=nmon sourcetype="nmon_collect" | table _time,host,_raw | rename _raw as event


#############################################################
# NMON Processing Activity
#############################################################

[Activity of NMON Data Processing]
action.email.reportServerEnabled = 0
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = -24h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","hostname"]
display.events.type = raw
display.general.type = statistics
display.statistics.drilldown = none
display.statistics.rowNumbers = 1
display.visualizations.chartHeight = 420
display.visualizations.charting.chart = line
display.visualizations.charting.chart.style = minimal
display.visualizations.show = 0
display.visualizations.type = singlevalue
request.ui_dispatch_app = nmon
request.ui_dispatch_view = search
search = index=nmon sourcetype=nmon_processing | stats values(hostname) As "hostname (Nmon host)", values(_raw) As event by _time,host | rename host As "host (collecter)" | sort - _time


#############################################################
# NMON Activity - Splunkd events
#############################################################

[Activity of NMON - Splunkd events]
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","hostname"]
display.events.type = raw
display.statistics.drilldown = none
display.statistics.rowNumbers = 1
display.visualizations.chartHeight = 420
display.visualizations.charting.chart.style = minimal
display.visualizations.show = 0
request.ui_dispatch_app = nmon
request.ui_dispatch_view = search
search = index=_internal sourcetype=splunkd nmon *Processor


#############################################################
# NMON Report Inventory
#############################################################

[NMON Inventory Solaris]
action.email.reportServerEnabled = 0
action.email.useNSSubject = 1
alert.track = 0
display.events.fields = ["host","source","sourcetype","hostname"]
display.events.type = raw
display.general.type = statistics
display.statistics.drilldown = none
display.statistics.rowNumbers = 1
display.visualizations.chartHeight = 420
display.visualizations.charting.chart = line
display.visualizations.charting.chart.style = minimal
display.visualizations.show = 0
display.visualizations.type = singlevalue
request.ui_dispatch_app = nmon
request.ui_dispatch_view = search
search = | inputlookup nmon_inventory | search OStype=Solaris\
| fields hostname,OStype,Solaris_sunOS_version,Solaris_version,cpu_cores,Processor,Solaris_processor_clockspeed,nmon_version

[NMON Inventory Linux]
action.email.reportServerEnabled = 0
action.email.useNSSubject = 1
alert.track = 0
display.events.fields = ["host","source","sourcetype","hostname"]
display.events.type = raw
display.general.type = statistics
display.statistics.drilldown = none
display.statistics.rowNumbers = 1
display.visualizations.chartHeight = 420
display.visualizations.charting.chart = line
display.visualizations.charting.chart.style = minimal
display.visualizations.show = 0
display.visualizations.type = singlevalue
request.ui_dispatch_app = nmon
request.ui_dispatch_view = search
search = | inputlookup nmon_inventory | search OStype=Linux\
| fields hostname,OStype,cpu_cores,Processor,Linux_memory_MB,Linux_swap_MB,Linux_distribution,Linux_kernelversion,nmon_version

[NMON Inventory AIX]
action.email.reportServerEnabled = 0
action.email.useNSSubject = 1
alert.track = 0
display.events.fields = ["host","source","sourcetype","hostname"]
display.events.type = raw
display.general.type = statistics
display.statistics.drilldown = none
display.statistics.rowNumbers = 1
display.visualizations.chartHeight = 420
display.visualizations.charting.chart = line
display.visualizations.charting.chart.style = minimal
display.visualizations.show = 0
display.visualizations.type = singlevalue
request.ui_dispatch_app = nmon
request.ui_dispatch_view = search
search = | inputlookup nmon_inventory | search OStype=AIX\
| fields  hostname,OStype,AIX_Machine_SerialNumber,AIX_virtualcpus,AIX_logicalcores,entitled,Processor,AIX_processor_mode,AIX_processor_clockspeed,AIX_cpu_type,AIX_kernel_type,AIX_plateform_firmware_level,nmon_version,AIX_PoolID,AIX_system_installed_CPUs,AIX_system_active_CPUs,AIX_PoolCPUs
